README.org
#+STARTUP: showeverything
#+OPTIONS: toc:4 h:4
#+OPTIONS: ^:nil
#+HTML_HEAD: <style>
#+HTML_HEAD:     table { border: 1px solid black; border-collapse:collapse; margin-left: 2%; }
#+HTML_HEAD:     th.org-left   { border: 1px solid black; text-align: left; background-color: lightgray  }
#+HTML_HEAD:     td.org-left   { border: 1px solid black; text-align: left; font-family: monospace; }
#+HTML_HEAD: </style>
#+AUTHOR: Adam Taylor
#+EMAIL: mr.adtaylor@gmail.com
#+TITLE: A _Portable_ and _Literate_ Emacs Initialization

   #+NAME: custom-vars-table
   #+BEGIN_SRC emacs-lisp :results silent :exports results :var custom-vars=() :tangle no
     ;; This "function" creates a list that is converted to a table by the exporter
     `((Symbol\ Name Value)
       hline
       ,@(cl-loop for cv in custom-vars
                  collect `(,cv
                            ,(replace-regexp-in-string "\n" "<br>" (string-trim-right (pp-to-string (default-value cv)))))))
   #+END_SRC


* Overview
  This is my literate and @@html:<font color=red size=+3><b><u>@@portable@@html:</u></b></font>@@ Emacs initialization.
** Quick start
   Simply

   1. git clone this repository into =~/.emacs.d=: =git clone https://github.com/Atman50/emacs-config.git =/.emacs.d=

   2. start Emacs

   That's it.

   Starting Emacs for the first time on a new machine loads all the packages/configuration loads. It takes some time on this first
   load since all the packages referenced need to download and compile. On subsequent Emacs invocations startup time is much better.
   The ability to simply clone and start is what makes this configuration *portable*. Note that some of the Emacs customization (see
   =custom.el=) are system (file system) dependent. I handle this by using git to create a stash of the localized changes for
   =custom.el= and then apply it whenever I take updated configurations from the repository.

** Why a literate configuration
   Well mostly I wanted to learn how to do it, but also I was having issues with managing my initialization/configuration. FWIW
   this is the approach that I came up with. My  =init.el= file is simple and relies on the fact that customizations are saved to
   its own file and that these customizations are read in before the packages are loaded.

   What I've gotten out of all this work is a portable and documented configuration that works well for me. Please feel free to
   take whatever portion(s) you wish from this and make it your own.

   I have tried to make this configuration 100% portable meaning that on a new system (Linux or Windows at this point) with Emacs
   installed. I simple git clone this repository to =~/.emacs.d= and then fire up Emacs. Should work every time. 

** =init.el=, short and sweet

   #+BEGIN_SRC emacs-lisp -n 11 :tangle no
     (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
     (load custom-file t)
     (prefer-coding-system 'utf-8)
     (unless (boundp 'package-user-dir)
       (unless (boundp 'package-archive-contents)
         (package-initialize))
       (unless (assoc 'use-package package-archive-contents)
         (package-refresh-contents)
         (package-install (elt (cdr (assoc 'org-plus-contrib package-archive-contents)) 0))
         (package-install (elt (cdr (assoc 'use-package package-archive-contents)) 0))))
     (load "use-package")
     (use-package org)
     (defcustom my/cfg-file (concat user-emacs-directory "README")
       "The base name for the .org file to use for Emacs initialization."
       :group 'my-configuration
       :type 'string)
     (when (file-newer-than-file-p (concat my/cfg-file ".org") (concat my/cfg-file ".el"))
       (org-babel-tangle-file (concat my/cfg-file ".org")))
     (load my/cfg-file)
   #+END_SRC

   | Line | Explained                                                                                  |
   |------+--------------------------------------------------------------------------------------------|
   |   11 | Breaking the custom setting out into its own file allows it to be loaded in the next line  |
   |   12 | Load the custom file. All custom settings will now be honored by packages when loaded.     |
   |   13 | Just a fix for ELPA packages with (certain?) Unicode characters in them.                   |
   |   14 | If there's no ='package-user-dir= defined; =package.el= isn't loaded                       |
   |   15 | If there's no ='package-archive-contents= defined; package archives have not been read     |
   |   16 | Initialize the package system                                                              |
   |   17 | If we've not load loaded the definition for the =use-package= ELPA package, then           |
   |   18 | Refresh (read) the package archives. Note: ='package-archives= from =custom.el= *key* here |
   |   19 | Load up the org-mode. The pre-packaged org-mode does not have Babel!                       |
   |   20 | Load up =use-package=                                                                      |
   |   21 | Make sure =use-package= is available                                                       |
   |   22 | Make sure =org-plus-contrib= is available                                                  |
   |   23 | Create customizable config variable                                                        |
   |   24 | ...                                                                                        |
   |   25 | ... it's nice having a customizable group for personal configuration settings              |
   |   26 | ...                                                                                        |
   |   27 | If the .el file doesn't exist or is older than this file then...                           |
   |   28 | ... create the tangled output of this file                                                 |
   |   29 | Load the tangled output of this file                                                       |
   
