README.org
*** Loading the custom file first
    One of the nicest things about Emacs is the extensive and quite useful customization engine. You can customize variables and
    faces with ease and make the settings work for you.

    Loading the customized variables before the package (using =use-package= of course) means that you can now use the customization
    facility in Emacs to modify the variables and have them stick between Emacs invocations. I see lots of configurations with the
    =:config= section of a =use-package= invocation performing variable setting. The problem with this is that if you want to change
    it using Emacs, the loading of the customizations first causes your new customizations getting overwritten on the next start of
    Emacs. You can do it in the reverse order; =use-package= first, then customize, but then you couldn't customize the variable
    using the customization system.

    Therefore I try to minimize =use-package= customizations and mostly use the =custom.el= file.

    The most important custom variable for this configuration is =package-archives=, which is used by the loading of the various
    extension packages used by this configuration.

    #+NAME: init-file-custom-vars
    #+CALL: custom-vars-table(custom-vars='(package-archives))

*** Customizing the configuration
    I've started to use the =defcustom= function to describe those "variables that impact initialization" and are all placed into
    the ='my-configuration= group. Each of the configuration variables can be accessed using =M-x customize-group my-configuration=.
    This allows me to select features to turn on or off selectively and make them sticky if so desired.

    Another reason to load the customization file first.
* My Configuration
  Here are my configuration bits. All of the following code snippets are tangled from this file into an =.el= file that gets loaded
  from the initialization file. Feel free to take as little or as much as you like from here.
** A preamble
   This is a little piece of code that I picked up that might make things faster when downloading and installing all the packages.
   This turns down the garbage collector during the use-package loading when it has to do some compiling. Set it back when done with
   init.
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq gc-cons-threshold 64000000)
     (add-hook 'after-init-hook (lambda () (setq gc-cons-threshold 800000)))
   #+END_SRC

** General packages
   Here are some general packages I use
*** Speed up line movement
    I ran into this little tidbit while reading Sacha Chua's posts from Emacs. It is described [[https://emacs.stackexchange.com/questions/28736/emacs-pointcursor-movement-lag/28746][here]], but to summarize the
    =next-line= defun triggers =line-move-partial= which leads to excessive processing. By setting the variable here, the speed of
    using =next-line= gets very cut down.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq auto-window-vscroll nil)
    #+END_SRC
*** Use Ctrl-Z for personal bindings
    Ctrl-c was supposed to be left for personal customization but seems to get used more than it should,
    therefore I've started to bind things to Ctrl-Z, which had the annoying and useless minimize functionality.

    #+BEGIN_SRC  emacs-lisp :tangle yes
      (bind-keys :map global-map                      ;; get rid of pesky "\C-z" and use for personal bindings
                 :prefix-map my-ctrl-z-prefix-map
                 :prefix "C-z"
                 ("C-d" . dired-jump)
                 ("n"   . linum-mode)
                 ("g"   . magit-status)
                 ("r"   . revert-buffer)
                 ("t"   . toggle-truncate-lines)
                 ("c"   . comment-region)
                 ("u"   . uncomment-region))
    #+END_SRC

*** [[https://github.com/myrjola/diminish.el][=diminish=]]
    Handy mode to make the modeline more succinct by allowing a /diminished/ mode line string. Sometimes the fact that mode is there
    is fine and it doesn't need to be on the mode line (diminish it to "").
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package diminish)
    #+END_SRC
*** [[https://github.com/priyadarshan/bind-key][=bind-key=]]
    Much better binding capabilities (in later versions this is already loaded via =use-package=).
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package bind-key)
    #+END_SRC
*** [[https://github.com/Wilfred/helpful][=helpful=]]
    [[https://github.com/Wilfred/helpful][Helpful]] provides contextual help and other features. Here are two blogs that provide good information: [[http://www.wilfred.me.uk/blog/2017/08/30/helpful-adding-contextual-help-to-emacs/][initial Helpful blog]] and
    [[http://www.wilfred.me.uk/blog/2018/06/22/helpful-one-year-on/][Helpful, one year in]]. More in-depth help along with lots of other information like references, edebug capabilities, ...
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package helpful
        :bind (("C-z h a" . helpful-at-point)
               ("C-z h c" . helpful-command)
               ("C-z h C" . helpful-callable)
               ("C-z h f" . helpful-function)
               ("C-z h k" . helpful-key)
               ("C-z h m" . helpful-macro)
               ("C-z h v" . helpful-variable)))
    #+END_SRC
*** [[https://www.emacswiki.org/emacs/SaveHist][=savehist=]]
    A great built-in that allows us to have a history file. This means certain elements are saved between sessions of Emacs. This
    history file is kept in =~/.emacs.d/savehist=.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package savehist)
    #+END_SRC
    Set the following variables to control =savehist= (use customize).
    #+NAME: savehist-custom-vars
    #+CALL: custom-vars-table(custom-vars='(savehist-file savehist-additional-variables savehist-mode))

*** Themes and mode line
    Recently switched from =powerline= to =moody=. The =moody= interface gives a nice tabbed mode line. I considered making my own
    version of the =leuven= template to avoid all this =set-face-attribute= stuff below, but this is much more compact than mucking
    around with the themes. Perhaps someday.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package leuven-theme
        :config
        (load-theme 'leuven t)
        (let ((line (face-attribute 'mode-line :underline)))
          (set-face-attribute 'mode-line nil
                              :overline line
                              :box nil
                              :foreground "deep sky blue")
          (set-face-attribute 'mode-line-inactive nil
                              :overline line
                              :underline line
                              :box nil
                              :foreground "#335EA8"
                              :background "gray64")
          (set-face-attribute 'mode-line-buffer-id nil
                              :foreground "firebrick3"
                              :overline line)
          (set-face-attribute 'mode-line-highlight nil
                              :foreground "gold")
          (set-face-attribute 'mode-line-emphasis nil
                              :foreground "gold")
          (set-face-attribute 'compilation-error nil        ;; red on blue is hard to read
                              :background "gray64")

          (set-face-attribute 'which-func nil
                              :foreground "light goldenrod")))
      (use-package moody
        :config
        (setq x-underline-at-descent-line t)
        (moody-replace-mode-line-buffer-identification)
        (moody-replace-vc-mode))
    #+END_SRC
