README.org
*** For demonstrations
    These packages are useful when doing presentations.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package command-log-mode :defer t)
    #+END_SRC

*** Trying [[https://github.com/abingham/emacs-codesearch][=codesearch=]]
    =Codesearch= is Google tool written in Go. You'll need to [[https://golang.org/doc/install][install Go]] on your system. Install [[https://github.com/abingham/emacs-codesearch][=codesearch=]] by issuing the command
    =go get github.com/google/codesearch/cmd/...=.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package codesearch :defer t)
    #+END_SRC

*** [[https://github.com/justbur/emacs-which-key][=which-key=]]
    Perhaps one of the most useful extensions, this little gem will provide a list in the mini-buffer of the relevant keystrokes and
    the functions to which they are bound (or a prefix). Many times I've found unknown features by simply looking at the various
    options. This is, IMO, a great way to learn Emacs key-bindings.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (use-package which-key :diminish "")
    #+END_SRC
*** Other useful packages
    OK, a little tired of documenting each package on it's own. These packages are just generally useful.
    #+BEGIN_SRC emacs-lisp -r :tangle yes
      (use-package realgud)           ;; A "better" gud
      (use-package projectile
        :config
        (define-key projectile-mode-map (kbd "C-z C-p") 'projectile-command-map)
        (projectile-mode t))
      (use-package ibuffer-projectile :defer t)
      (use-package xterm-color :defer t)
      (use-package sh-script :defer t)
      (use-package desktop
        :config
        (set-variable 'desktop-path (cons default-directory desktop-path))) (ref:desktop-path)
      (use-package lispy
        :config
        (add-hook 'emacs-lisp-mode-hook (lambda () (lispy-mode 1)))
        (add-hook 'minibuffer-setup-hook (lambda () (when (eq this-command 'eval-expression) (lispy-mode 1)))))

      (use-package powershell
        :if mswindows-p)
    #+END_SRC
    Note that the setting of [[(desktop-path)][=desktop-path=]] allows the multiple =.emacs.desktop= files, each in the directory where =emacs= was
    started. Although =desktop-path= is changed outside =custom.el=, I've included it here in the table below so you can see that
    the default is augmented with the start-up directory which in this case is =~/.emacs.d=.

    Customized variables of interest here:

    #+NAME: other-pkgs-custom-vars
    #+CALL: custom-vars-table(custom-vars='(desktop-path desktop-save-mode))
*** A little nXML configuration
    It ends up that the XML I've been editing for work is indented with tabs. This little tidbit should set it up correctly.
    #+BEGIN_SRC emacs-lisp :tangle yes
      (add-hook 'nxml-mode-hook (lambda () (setq nxml-child-indent 8 indent-tabs-mode t)))
    #+END_SRC

* [[http://company-mode.github.io/][=company-mode=]] Configuration
  Use the excellent [[http://company-mode.github.io/][=company-mode=]] modular in-buffer text completion framework. In particular this is used for [[https://github.com/jorgenschaefer/elpy][=elpy=]] (python) mode and
  [[https://github.com/OmniSharp/omnisharp-emacs][=omnisharp=]] (C#) mode, although it is used elsewhere.
  #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package company
      :diminish)
  #+END_SRC
* [[https://github.com/abo-abo/swiper][=ivy/swiper=]] Configuration
  I used to be a =helm= user, but switched to =ivy=. Lots of nice features in =ivy= and very easy to configure comparatively.
  #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package ivy
      :diminish ""
      :bind (:map ivy-minibuffer-map
                  ("C-w" . ivy-yank-word)           ;; make work like isearch
                  ("C-r" . ivy-previous-line))
      :config
      (ivy-mode 1)
      (setq ivy-initial-inputs-alist nil)           ;; no regexp by default
      (setq ivy-re-builders-alist                   ;; allow input not in order
            '((t . ivy--regex-ignore-order))))
    (use-package counsel
      :bind (("C-z j" . counsel-imenu)))
    (use-package counsel-projectile
      :config
      (counsel-projectile-mode t))
    (use-package counsel-codesearch)
    (use-package ivy-hydra)
    (use-package swiper
      :bind (("C-S-s" . isearch-forward)            ;; Keep isearch-forward on Shift-Ctrl-s
             ("C-s" . swiper)                       ;; Use swiper for search and reverse search
             ("C-S-r" . isearch-backward)           ;; Keep isearch-backward on Shift-Ctrl-r
             ("C-r" . swiper)))
    (use-package avy
      :bind (("C-:" . avy-goto-char))) 
    (use-package ivy-posframe
      :if (>= emacs-major-version 26)
      :config (setq ivy-display-function #'ivy-posframe-display))
  #+END_SRC
  I ran into a nice article that fixes a [[http://mbork.pl/2018-06-16_ivy-use-selectable-prompt][problem that I often have with Ivy]]: using a name that is not in the list of candidates (for
  example when trying to write to a buffer to a new file name). To fix this, setting =ivy-use-selectable-prompt= to =t= makes going
  back before the first candidate to a "verbatim" prompt.

  Customized variables:
  #+NAME: ivy-custom-vars
  #+CALL: custom-vars-table(custom-vars='(ivy-count-format ivy-height ivy-mode ivy-use-selectable-prompt ivy-use-virtual-buffers))
* [[https://github.com/raxod502/prescient.el][=prescient=]] Configuration
  [[https://github.com/raxod502/prescient.el][=prescient=]] provides "simple but effective sorting and filtering for Emacs."
  #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package prescient)
    (use-package ivy-prescient)
    (use-package company-prescient)
  #+END_SRC
* [[https://www.emacswiki.org/emacs/Yasnippet][=yasnippet=]] Configuration
  [[https://www.emacswiki.org/emacs/Yasnippet][=yasnippet=]] is a truly awesome package. Local modifications should go in =~/.emacs.d/snippets/=.

  Just love the [[https://www.emacswiki.org/emacs/Yasnippet][=yasnippet=]] package. I only wish there were more templates out there. Creating new ones and placing them the
  appropriate (mode-named) subdirectory of =~/.emacs.d/snippets/=.
  #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package warnings)
    (use-package yasnippet
      :diminish (yas-minor-mode . "")
      :config
      (yas-reload-all)
      ;; fix tab in term-mode
      (add-hook 'term-mode-hook (lambda() (yas-minor-mode -1)))
      ;; Fix yas indent issues
      (add-hook 'python-mode-hook (lambda () (set (make-local-variable 'yas-indent-line) 'fixed)))
      ;; Setup to allow for yasnippets to use code to expand
      (add-to-list 'warning-suppress-types '(yasnippet backquote-change)))
    (use-package yasnippet-snippets)
  #+END_SRC
  The following code allows the =yasnippet= and =company= to work together. Got this from a fix posted on [[https://gist.github.com/sebastiencs/a16ea58b2d23e2ea52f62fcce70f4073][github]] which was pointed
  to by the [[https://www.emacswiki.org/emacs/CompanyMode#toc11][company mode Wiki page]].
  #+BEGIN_SRC emacs-lisp :tangle yes
    (advice-add 'company-complete-common :before (lambda () (setq my-company-point (point))))
    (advice-add 'company-complete-common :after (lambda ()
                                                  (when (equal my-company-point (point))
                                                    (yas-expand))))
  #+END_SRC
  Customizations of interest:
  #+NAME: yas-custom-vars
  #+CALL: custom-vars-table(custom-vars='(yas-global-mode))
