README.org
** Use of babel
   To do literate programming you need to include the languages to "tangle". Here I've added more than just the standard
   =emacs-lisp= value. Added Python, [[http://plantuml.com/][PlantUML]], and shell.
   #+NAME: org-babel-custom-vars
   #+CALL: custom-vars-table(custom-vars='(org-babel-load-languages)))

* python configuration
  At one point I was using anaconda but have switched back to elpy. I really like =eply-config= that tells you if everything is
  working properly. I've been using a =virtualenv= for my python development and couldn't be happier. Perhaps the only thing that
  bothers me is that when an object is returned, PyCharm will give you list and dictionary methods while =eply=/=company= does not.
  Seems to be the only real issue at this point.

** The tale of two IDEs
   I've decided to take the [[https://langserver.org/][Language Server Protocol]] out for a spin. Unfortunately it might be a while before I decide to switch
   since there are some things I find a little annoying, like initial startup speed of loading a large Python file into Emacs,
   presumably because =lsp-mode= is initializing. Either way, the Python IDE is selected using the.

   To switch between the two IDEs might take a bit of futzing - I've had to go remove =elpy= entries from =~/.emacs.d/custom.el= to
   switch to the =lsp-mode=.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defcustom my/use-elpy t
       "Setting to t uses elpy as the Python IDE. Set to nil to use lsp."
       :group 'my-configuration
       :type '(choice
               (const :tag "lsp" nil)
               (const :tag "elpy" t)))
   #+END_SRC
*** [[https://github.com/jorgenschaefer/elpy][=elpy=]] IDE
    The tried and true [[https://github.com/jorgenschaefer/elpy][=elpy=]] Python IDE.
  #+BEGIN_SRC emacs-lisp :tangle yes
    (when my/use-elpy
      (use-package elpy
        :demand t
        :bind (:map elpy-mode-map
                    ("C-z ." . elpy-goto-definition))
        :config
        (elpy-enable)
        (add-to-list 'python-shell-completion-native-disabled-interpreters "jupyter")
        (use-package company-jedi
          :config
          (push 'company-jedi company-backends))))
   #+END_SRC
*** [[https://github.com/emacs-lsp/lsp-mode][=lsp-mode=]] IDE
    This is a newer mode based on the [[https://langserver.org/][Language Server Protocol]]. Used along with this is the [[https://github.com/emacs-lsp/lsp-ui][=lsp-ui=]] goodies.
  #+BEGIN_SRC emacs-lisp :tangle yes
    (unless my/use-elpy
        (use-package lsp-mode
          :demand t
          :config
          (use-package lsp-python)
          (add-hook 'lsp-after-open-hook #'lsp-enable-imenu)  
          (lsp-define-stdio-client lsp-python "python" #'projectile-project-root '("pyls"))
          (use-package lsp-ui
            :config
            (require 'lsp-imenu)
            (add-hook 'lsp-mode-hook 'lsp-ui-mode))
          (use-package company-lsp
            :config
            (push 'company-lsp company-backends))
          (add-hook 'lsp-after-initialize-hook (lambda ()
                                                 (let ((lsp-cfg `(:pyls (:configurationSources ("flake8")))))
                                                   (lsp--set-configuration lsp-cfg))))))

   #+END_SRC
** Python IDE-agnostic configuration
   The =remove-hook= call in the =:config= section of the =flymake= package install is there because of the persistent, and annoying,
   output to the =*Flymake Log*= buffer:
   #+BEGIN_QUOTE
   Warning [flymake create_and_activate_device.py]: Disabling backend flymake-proc-legacy-flymake because (error Can’t find a suitable init function)
   #+END_QUOTE
   The =remove-hook= relieves this issue. NB: this may be for Emacs version 27.0.50 only.
   #+BEGIN_SRC emacs-lisp :tangle yes
     (use-package pylint)
     (use-package python-docstring
       :config
       (python-docstring-install))
     (use-package flymake
       :config
       (remove-hook 'flymake-diagnostic-functions 'flymake-proc-legacy-flymake)
       (when my/use-elpy (add-hook 'flymake-mode-hook (lambda ()
                                                        (setq flymake-start-syntax-check-on-newline t
                                                              flymake-no-changes-timeout 0.5)))))
     (use-package python
       ;; :bind (:map python-mode-map
       ;;             ("C-c n" . flymake-goto-next-error)
       ;;             ("C-c p" . flymake-goto-prev-error))
       :config
       (add-hook 'inferior-python-mode-hook (lambda () (setq tab-width 4)))
       (add-hook 'python-mode-hook (lambda ()
                                     (unless my/use-elpy (lsp-python-enable))
                                     (flymake-mode)
                                     (company-mode))))
   #+END_SRC
   Customized variables used in this python configuration:
   #+NAME: python-custom-vars
   #+CALL: custom-vars-table(custom-vars='(python-check-command python-shell-interpreter python-shell-interpreter-args python-shell-prompt-detect-failure-warning python-shell-prompt-output-regexp python-shell-prompt-regexp))

* Additional bits-o-configuration
** Limit the length of [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Which-Function.html][=which-function=]]
   [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Which-Function.html][=which-function=]] which is used on the mode-line has no maximum method/function signature. This handy adviser limits the name to
   64 characters.
   #+BEGIN_SRC emacs-lisp :tangle yes
     (defcustom  my/which-function-max-width 64
       "The maximum width of the which-function string."
       :group 'my-configuration
       :type 'integer)

     (advice-add #'which-function :filter-return
                 (lambda (s) (when (stringp s)
                               (if (< (string-width s) my/which-function-max-width) s
                                 (concat (truncate-string-to-width s (- my/which-function-max-width 3)) "...")))))
   #+END_SRC
** =my-ansi-term=
   Allows me to name my ANSI terms. Was very useful when I used more ANSI shells (so that tabs were interpreted by the shell). Some
   other modes and shells make this less useful these days.
   #+BEGIN_SRC emacs-lisp :tangle yes
     (cl-defun my-ansi-term (term-name cmd)
       "Create an ansi term with a name - other than *ansi-term* given TERM-NAME and CMD."
       (interactive "sName for terminal: \nsCommand to run [/bin/bash]: ")
       (ansi-term (if (= 0 (length cmd)) "/bin/bash" cmd))
       (rename-buffer term-name))
   #+END_SRC
** Understand file type by shebang
   When a file is opened and it is determined there is no mode (fundamental-mode) this code reads the first line of the file looking
   for an appropriate shebang for either python or bash and sets the mode for the file.
   #+BEGIN_SRC emacs-lisp :tangle yes
     (cl-defun my-find-file-hook ()
       "If `fundamental-mode', look for script type so the mode gets properly set.
     Script-type is read from #!/... at top of file."
       (if (eq major-mode 'fundamental-mode)
           (ignore-errors
               (save-excursion
                 (goto-char (point-min))
                 (re-search-forward "^#!\s*/.*/\\(python\\|bash\\).*$")
                 (if (string= (match-string 1) "python")
                     (python-mode)
                   (sh-mode))))))

     (add-hook 'find-file-hook 'my-find-file-hook)
   #+END_SRC

